CSI API ETABS v1

# cSapModelDesignConcreteSlab Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDesignConcreteSlab DesignConcreteSlab { get; }

    ReadOnly Property DesignConcreteSlab As cDesignConcreteSlab
    	Get

    Dim instance As cSapModel
    Dim value As cDesignConcreteSlab

    value = instance.DesignConcreteSlab

    property cDesignConcreteSlab^ DesignConcreteSlab {
    	cDesignConcreteSlab^ get ();
    }

    abstract DesignConcreteSlab : cDesignConcreteSlab with get

#### Property Value

Type: cDesignConcreteSlab

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com